// 매개 변수 a와 b 는 값이 들어갈 공간 -> 없으면 값을 넣을 수 가 없음
// function sum(a,b){
//   return a + b;
//   return : 뱉어

// }

// console.log(sum(9,1));


// 내가 만들고 싶은거 = 스크롤을 내린 만큼 음악이 자연스럽게 소리가 줄었다 커졌다 하는 것
// 어떤 알고리즘으로 만들 수 있을까?
// 1번 트랙 음량= a / 2번 트랙 음량= b 라고 지정 
// 최대음량으로 만들고 싶은 스크롤의 y좌표를 A, B로 설정
// 현재 스크롤의 y 좌표를 y로 표시
// 맨 처음 페이지를 틀었을때 나오는 기본 음량 = 10(이거는 바뀔수 있으나 항상 일정한 상수임)


// 내가 생각한 구조

// 1. y<A 일때 y+10=a     ->     A<y<(A+B)/3*2 일때 -y+10=a     -> (A+B)/3*2<y 일때 y*0=a
//   y<(A+B)/3*1 y*0=b       ->     (A+B)/3*1<y<B 일때 y+10=b    ->   B<y 일때    -> -y+10=b


// 위의 논리를 함수로 만들기 위해 필요한 거
//  조건을 설정하는 것  (일때)
//  변수의 범위 지정 (부등호)
//  스크롤의 y좌표를 변수로 설정해주는 함수 (현재 = y) (지정 = A,B)
//  원하는 음악의 음량을 변수로 설정하는 방법 (a,b)
//  기본음량이 처음 페이지를 열었을때 들려도 놀라거나 거슬리지 않을 정도를 찾기